<?php
	//----------------------------------------------------------------------------------------------
	//= 初期化
	//----------------------------------------------------------------------------------------------
		include("init.php");

	//----------------------------------------------------------------------------------------------
	//= セッションを取得
	//----------------------------------------------------------------------------------------------
		$UserName = $_SESSION["UserName"];
		$Password = $_SESSION["Password"];
		$FileName = $_GET["file"];

	//----------------------------------------------------------------------------------------------
	//= FTPへ接続
	//----------------------------------------------------------------------------------------------
		if( $FTP=ftp_connect($ServerIP, $ServerPort) ){} else {
			Error("データベースサーバーへの接続が失敗しました。<br>
					しばらく経っても改善されない場合は、管理者に知らせてください。");
			exit();
		}
		//ログイン
		if( ftp_login($FTP, $UserNameHeader.$UserName, $Password) ){
			$_SESSION["UserName"] = $UserName;
			$_SESSION["Password"] = $Password;
			//ファイルを削除
			ftp_delete($FTP, $FileName);
			ftp_delete($FTP, "./t/".$FileName);	//サムネイル画像
			//マイページへ移動
			header('Location: mypage.php');
		} else {
			Error("ログインに失敗しました。<br>
					ユーザー名またはパスワードが正しくありません。");
			exit();
		}

		//FTP サーバから切断する。
		ftp_close( $FTP );
?>