<?php
//--------------------------------------------------------------------------------------------------
//= インデックス
//--------------------------------------------------------------------------------------------------

	//----------------------------------------------------------------------------------------------
	//= 初期化
	//----------------------------------------------------------------------------------------------
		include("init.php");

	//----------------------------------------------------------------------------------------------
	//= セッションを取得
	//----------------------------------------------------------------------------------------------
		$UserName = $_SESSION["UserName"];
		$Password = $_SESSION["Password"];

	//----------------------------------------------------------------------------------------------
	//= ページ設定
	//----------------------------------------------------------------------------------------------
		$PageTitle = "HIJKCapture"

?>

<!--------------------------------------------------------------------------------------------------
//= 以下ページ出力
--------------------------------------------------------------------------------------------------->
<!DOCTYPE html>
<html lang="ja">
	<?php
		include('html_head.php');
	?>
	<body>
		<div class="container">
			<div class="pagetitle">
				HIJKCapture
			</div>
			<div class="form-login">
				<div class="form-title">
					ログイン
				</div>
				<form name="login" method="post" action="login.php"  style="text-align:center;">
					<input name="UserName"	type="text" value="<?php print($UserName); ?>" placeholder="UserName" class="input-block-level"><br>
					<input name="Password"	type="password" value="<?php print($Password); ?>" placeholder="Password" class="input-block-level"><br>
					<input class="btn btn-primary" name="Submit"	type="submit" value="ログイン"><br>
			</div>
		</div>
	</body>
</html>