<?php
//--------------------------------------------------------------------------------------------------
//= ログイン処理
//--------------------------------------------------------------------------------------------------

	//----------------------------------------------------------------------------------------------
	//= 初期化
	//----------------------------------------------------------------------------------------------
		include("init.php");
		$UserName = $_POST["UserName"];
		$Password = $_POST["Password"];

	//----------------------------------------------------------------------------------------------
	//= FTPサーバーへ接続する
	//----------------------------------------------------------------------------------------------
		if( $FTP=ftp_connect($ServerIP, $ServerPort) ){} else {
			Error("データベースサーバーへの接続が失敗しました。<br>
					しばらく経っても改善されない場合は、管理者に知らせてください。");
			exit();
		}
		//ログイン
		if( ftp_login($FTP, $UserNameHeader.$UserName, $Password) ){
			//クッキーにID,PASSを保存
			setcookie("UserName", $UserName, time()+$SessionLifeTime);
			setcookie("Password", $Password, time()+$SessionLifeTime);
			//マイページへ移動
			header('Location: mypage.php');
		} else {
			Error("ログインに失敗しました。<br>
					ユーザー名またはパスワードが正しくありません。");
			exit();
		}

		//FTP サーバから切断する。
		ftp_close( $FTP );

?>