<?php
	//----------------------------------------------------------------------------------------------
	//= 初期化
	//----------------------------------------------------------------------------------------------
		include("init.php");

	//----------------------------------------------------------------------------------------------
	//= セッションを取得
	//----------------------------------------------------------------------------------------------
		$UserName = $_SESSION["UserName"];
		$Password = $_SESSION["Password"];

	//----------------------------------------------------------------------------------------------
	//= ページ設定
	//----------------------------------------------------------------------------------------------
		$PageTitle = "HIJKCapture - マイページ";

	//----------------------------------------------------------------------------------------------
	//= サーバーから画像ファイルリストを取得
	//----------------------------------------------------------------------------------------------
		if( $FTP=ftp_connect($ServerIP, $ServerPort) ){} else {
			Error("データベースサーバーへの接続が失敗しました。<br>
					しばらく経っても改善されない場合は、管理者に知らせてください。");
			exit();
		}
		//ログイン
		if( ftp_login($FTP, $UserNameHeader.$UserName, $Password) ){
			$_SESSION["UserName"] = $UserName;
			$_SESSION["Password"] = $Password;
			//ファイルリストを取得
			$FileList = GetFileList($FTP);
		} else {
			Error("ログインに失敗しました。<br>
					ユーザー名またはパスワードが正しくありません。");
			exit();
		}

		//FTP サーバから切断する。
		ftp_close( $FTP );
?>

<!--------------------------------------------------------------------------------------------------
//= 以下ページ出力
--------------------------------------------------------------------------------------------------->
<!DOCTYPE html>
<html lang="ja">
	<?php
		include('html_head.php');
	?>
	<body>
		<div class="container">
			<div class="image-count">
				<i class="icon-picture"></i>
				<?php
					$cnt = count($FileList);
					if( $cnt != 0 ){
						print(count($FileList)."個の画像が見つかりました。<br>");
					} else {
						print("画像ファイルが見つかりませんでした。");
					}
				?>
			</div>
			<p class="myhr"></p>
			<?php
				$m = count($FileList);
				for( $i=0;$i<$m;$i++ ){
					DrawThumbnail($FileList[$i]);
				}
			?>
			<p class="myhr"></p>
			<a href="./" class="btn">ログイン画面へ戻る</a>
		</div>
	</body>
</html>