<?php
	//----------------------------------------------------------------------------------------------
	//= 初期化
	//----------------------------------------------------------------------------------------------
		include("init.php");

	//----------------------------------------------------------------------------------------------
	//= セッションを取得
	//----------------------------------------------------------------------------------------------
		$UserName = $_COOKIE["UserName"];
		$Password = $_COOKIE["Password"];

		//ログインしていない場合はindexへジャンプ
		LoginCheck();

	//----------------------------------------------------------------------------------------------
	//= ページ設定
	//----------------------------------------------------------------------------------------------
		$PageTitle = "HIJKCapture - マイページ";
		$ViewNumber = 100;	//マイページに表示される画像件数

	//----------------------------------------------------------------------------------------------
	//= サーバーから画像ファイルリストを取得
	//----------------------------------------------------------------------------------------------
		if( $FTP=ftp_connect($ServerIP, $ServerPort) ){} else {
			Error("データベースサーバーへの接続が失敗しました。<br>
					しばらく経っても改善されない場合は、管理者に知らせてください。");
			exit();
		}
		//ログイン
		if( ftp_login($FTP, $UserNameHeader.$UserName, $Password) ){
			//ファイルリストを取得
			$FileList = GetFileList($FTP);
			//タイムスタンプを取得
			$TimeStamp = GetTimeStamp($FileList);
			//タイムスタンプを元にファイルリストをソート
			array_multisort($TimeStamp, $FileList);
		} else {
			Error("ログインに失敗しました。<br>
					ユーザー名またはパスワードが正しくありません。");
			exit();
		}

		//FTP サーバから切断する。
		ftp_close( $FTP );
?>

<!--------------------------------------------------------------------------------------------------
//= 以下ページ出力
--------------------------------------------------------------------------------------------------->
<!DOCTYPE html>
<html lang="ja">
	<?php
		include('html_head.php');
	?>
	<body>
		<div class="container">
			<?php
				print($UserName." さんのマイページ<br>");
			?>
			<div class="image-count">
				<i class="icon-picture"></i>
				<?php
					$cnt = count($FileList);
					$n = $ViewNumber;
					if( $cnt != 0 ){
						print(count($FileList)." 件の画像が見つかりました。<br>");
						if( $cnt > $n ){
							print("<div class=\"alert\">");
							print("$n 件を超える画像はマイページに表示されません。 最新の $n 件のみを表示しています。");
							print("</div>");
						}
					} else {
						print("画像ファイルが見つかりませんでした。");
					}
				?>
			</div>
			<p class="myhr"></p>
			<?php
//				print(var_dump($FileList));
//				print("<br>");
//				print(var_dump($TimeStamp));
				$m = count($FileList);
				$n = $ViewNumber;
				for( $i = 0; $i < $m; $i++ ){
					if( $i >= $n ){
						break;
					}
					$file = substr($FileList[$m-1-$i], 0, 8);
					DrawThumbnail($file);
				}
			?>
			<p class="myhr"></p>
			<a href="./" class="btn">ログイン画面へ戻る</a>
		</div>
	</body>
</html>